Revit 2027 API
BuiltInFailures.RebarCouplerFailures.EngagementBiggerThanLengthError Property
 This is used to post error. The sum of bar engagements is greater than the total coupler length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EngagementBiggerThanLengthError { get; }
Public Shared ReadOnly Property EngagementBiggerThanLengthError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EngagementBiggerThanLengthError {
	FailureDefinitionId^ get ();
}
static member EngagementBiggerThanLengthError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace